(defparameter *Direct* ;;一般に使う８方向＋桂馬の４方向
  (make-array 12 :initial-contents
	      '(11 10 9 -1 -11 -10 -9 1 -21 -19 21 19)))

(defparameter *h_Direct* ;;飛車・龍に使う縦と横の４方向
  (make-array 4 :initial-contents
	      '(10 -1 -10 1)))

(defparameter *k_Direct* ;;角行・馬に使う縦と横の４方向
  (make-array 4 :initial-contents
	      '(11 9 -11 -9)))

(defparameter *CanGo* ;;その方向に進めるか否か（進めるなら１、進めないなら０を返す）
  (make-array '(12 31) :initial-contents
	      
	      '(;;11
		(0 0 0 0 1 0 0 0 1 0 0 0 0 0 0 1
		 0 0 0 1 1 0 0 1 1 1 1 1 0 0 1)
		;;10
		(0 0 0 0 0 1 0 0 1 1 1 1 1 0 1 0
		 1 0 0 1 1 0 0 1 1 1 1 1 0 1 0)
		;;9
		(0 0 0 0 1 0 0 0 1 0 0 0 0 0 0 1
		 0 0 0 1 1 0 0 1 1 1 1 1 0 0 1)
		;;-1
		(0 0 0 0 0 1 0 0 1 1 1 1 1 0 1 0
		 0 0 0 0 1 0 0 1 1 1 1 1 0 1 0)
		;;-11
		(0 0 0 0 1 1 0 0 1 1 1 1 1 0 0 1
		 0 0 0 1 0 0 0 1 0 0 0 0 0 0 1)
		;;-10
		(0 1 0 0 1 1 0 0 1 1 1 1 1 0 1 0
		 0 0 0 0 1 0 0 1 1 1 1 1 0 1 0)
		;;-9
		(0 0 0 0 1 1 0 0 1 1 1 1 1 0 0 1
		 0 0 0 1 0 0 0 1 0 0 0 0 0 0 1)
		;; 1
		(0 0 0 0 0 1 0 0 1 1 1 1 1 0 1 0
		 0 0 0 0 1 0 0 1 1 1 1 1 0 1 0)
		;;-21
		(0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0
		 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0)
		;;-19
		(0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0
		 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0)
		;;19
		(0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
		 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0)
		;;21
		(0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
		 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0))))
 
(defparameter *CanPromote* ;;成れるか否か
  (make-array 31 :initial-contents
	      '(0 1 1 1 1 0 1 1 0 0 0 0 0 0 0 0
		1 1 1 1 0 1 1 0 0 0 0 0 0 0 0)))
	      
		
